apache/nuttx/arch/arm/src/stm32/chip/stm32f44xxx_rcc.h
/* Spread spectrum clock generation register */

#define RCC_SSCGR_MODPER_SHIFT      (0)        /* Bit 0-12: Modulation period */
#define RCC_SSCGR_MODPER_MASK       (0x1fff << RCC_SSCGR_MODPER_SHIFT)
#  define RCC_SSCGR_MODPER(n)       ((n) << RCC_SSCGR_MODPER_SHIFT)
#define RCC_SSCGR_INCSTEP_SHIFT     (13)       /* Bit 13-27: Incrementation step */
#define RCC_SSCGR_INCSTEP_MASK      (0x7fff << RCC_SSCGR_INCSTEP_SHIFT)
#  define RCC_SSCGR_INCSTEP(n)      ((n) << RCC_SSCGR_INCSTEP_SHIFT)
#define RCC_SSCGR_SPREADSEL         (1 << 30)  /* Bit 30: Spread Select */
#define RCC_SSCGR_SSCGEN            (1 << 31)  /* Bit 31: Spread spectrum modulation enable */

/* PLLI2S configuration register */

#define RCC_PLLI2SCFGR_PLLI2SM_SHIFT (0)      /* Bits 0-5: Division factor M for audio PLL
                                                 (PLLI2S) input clock */
#define RCC_PLLI2SCFGR_PLLI2SM_MASK  (0x3f << RCC_PLLI2SCFGR_PLLI2SM_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SM(n)  ((n) << RCC_PLLI2SCFGR_PLLI2SM_SHIFT)

#define RCC_PLLI2SCFGR_PLLI2SN_SHIFT (6)     /* Bits 6-14: PLLI2S N multiplication factor for VCO */
#define RCC_PLLI2SCFGR_PLLI2SN_MASK  (0x1ff << RCC_PLLI2SCFGR_PLLI2SN_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SN(n)  ((n) << RCC_PLLI2SCFGR_PLLI2SN_SHIFT)
#define RCC_PLLI2SCFGR_PLLI2SP_SHIFT (16)   /* Bits 16-17: PLLI2S division factor for SPDIF-Rx clock */
#define RCC_PLLI2SCFGR_PLLI2SP_MASK  (0x1ff << RCC_PLLI2SCFGR_PLLI2SP_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SP(n)  ((n) << RCC_PLLI2SCFGR_PLLI2SP_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SP_2    RCC_PLLI2SCFGR_PLLI2SP(0)  /* 00: PLLI2S = 2 */
#  define RCC_PLLI2SCFGR_PLLI2SP_4    RCC_PLLI2SCFGR_PLLI2SP(1)  /* 01: PLLI2S = 4 */
#  define RCC_PLLI2SCFGR_PLLI2SP_6    RCC_PLLI2SCFGR_PLLI2SP(2)  /* 10: PLLI2S = 6 */
#  define RCC_PLLI2SCFGR_PLLI2SP_8    RCC_PLLI2SCFGR_PLLI2SP(3)  /* 11: PLLI2S = 8 */

#define RCC_PLLI2SCFGR_PLLI2SQ_SHIFT (24)   /* Bits 24-27: PLLI2S division factor for SAI1 clock*/
#define RCC_PLLI2SCFGR_PLLI2SQ_MASK  (0xf << RCC_PLLI2SCFGR_PLLI2SQ_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SQ(n)  ((n) << RCC_PLLI2SCFGR_PLLI2SQ_SHIFT)

#define RCC_PLLI2SCFGR_PLLI2SR_SHIFT (28)   /* Bits 28-30: PLLI2S division factor for I2S clocks */
#define RCC_PLLI2SCFGR_PLLI2SR_MASK  (7 << RCC_PLLI2SCFGR_PLLI2SR_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SR(n)  ((n) << RCC_PLLI2SCFGR_PLLI2SR_SHIFT)

/* PLLSAI configuration register */

#define RCC_PLLSAICFGR_PLLSAIM_SHIFT (0)    /* Bits 0-5: Division factor M for audio PLLSAI
                                               input clock */
#define RCC_PLLSAICFGR_PLLSAIM_MASK  (0x3f << RCC_PLLSAICFGR_PLLSAIM_SHIFT)
#  define RCC_PLLSAICFGR_PLLSAIM(n)  ((n) << RCC_PLLSAICFGR_PLLSAIM_SHIFT)

#define RCC_PLLSAICFGR_PLLSAIN_SHIFT (6)    /* Bits 6-14: PLLSAI divider (N) for VCO */
#define RCC_PLLSAICFGR_PLLSAIN_MASK  (0x1ff << RCC_PLLSAICFGR_PLLSAIN_SHIFT)
#  define RCC_PLLSAICFGR_PLLSAIN(n)  ((n) << RCC_PLLSAICFGR_PLLSAIN_SHIFT)

#define RCC_PLLSAICFGR_PLLSAIP_SHIFT (16)   /* Bits 16-17: PLLSAI division factor for 48 MHz clock */
#define RCC_PLLSAICFGR_PLLSAIP_MASK  (3 << RCC_PLLSAICFGR_PLLSAIP_SHIFT)
#  define RCC_PLLSAICFGR_PLLSAIP(n)  ((n) << RCC_PLLSAICFGR_PLLSAIP_SHIFT)
#  define RCC_PLLSAICFGR_PLLSAI_2     RCC_PLLSAICFGR_PLLSAIP(0)  /* 00: PLLSAI = 2 */
#  define RCC_PLLSAICFGR_PLLSAI_4     RCC_PLLSAICFGR_PLLSAIP(1)  /* 01: PLLSAI = 4 */
#  define RCC_PLLSAICFGR_PLLSAI_6     RCC_PLLSAICFGR_PLLSAIP(2)  /* 10: PLLSAI = 6 */
#  define RCC_PLLSAICFGR_PLLSAI_8     RCC_PLLSAICFGR_PLLSAIP(3)  /* 11: PLLSAI = 8 */
#define RCC_PLLSAICFGR_PLLSAIQ_SHIFT (24)     /* Bits 24-27: PLLSAI division factor for SAI clock */
#define RCC_PLLSAICFGR_PLLSAIQ_MASK  (0x0F << RCC_PLLSAICFGR_PLLSAIQ_SHIFT)
#  define RCC_PLLSAICFGR_PLLSAIQ(n)  ((n) << RCC_PLLSAICFGR_PLLSAIQ_SHIFT)


/* Dedicated clocks configuration register */

#define RCC_DCKCFGR_PLLI2SDIVQ_SHIFT (0)      /* Bits 0-4: PLLI2S division 1..32 factor for I2S clock */
#define RCC_DCKCFGR_PLLI2SDIVQ_MASK  (0x1F << RCC_DCKCFGR_PLLI2SDIVQ_SHIFT)
#  define RCC_DCKCFGR_PLLI2SDIVQ(n)  (((n)-1) << RCC_DCKCFGR_PLLI2SDIVQ_SHIFT)
#define RCC_DCKCFGR_PLLSAIDIVQ_SHIFT (8)      /* Bits 8-12: PLLSAI division 1..32 factor for SAI clock */
#define RCC_DCKCFGR_PLLSAIDIVQ_MASK  (0x1F << RCC_DCKCFGR_PLLSAIDIVQ_SHIFT)
#  define RCC_DCKCFGR_PLLSAIDIVQ(n)  (((n)-1) << RCC_DCKCFGR_PLLSAIDIVQ_SHIFT)
#define RCC_DCKCFGR_SAI1SRC_SHIFT    (20)     /* Bits 20-21: SAI1 clock source selection */
#define RCC_DCKCFGR_SAI1SRC_MASK     (0x3 << RCC_DCKCFGR_SAI1SRC_SHIFT)
#  define RCC_DCKCFGR_SAI1SRC(n)     ((n) << RCC_DCKCFGR_SAI1SRC_SHIFT)
#define RCC_DCKCFGR_SAI2SRC_SHIFT    (22)     /* Bits 22-23: SAI2 clock source selection */
#define RCC_DCKCFGR_SAI2SRC_MASK     (0x3 << RCC_DCKCFGR_SAI2SRC_SHIFT)
#  define RCC_DCKCFGR_SAI2SRC(n)     ((n) << RCC_DCKCFGR_SAI2SRC_SHIFT)
#define RCC_DCKCFGR_TIMPRE           (1 << 24) /* Bit 24: Timer clock prescaler selection */
#define RCC_DCKCFGR_I2S1SRC_SHIFT    (25)     /* Bits 25-26: I2S APB1 clock source selection */
#define RCC_DCKCFGR_I2S1SRC_MASK     (0x3 << RCC_DCKCFGR_I2S1SRC_SHIFT)
#  define RCC_DCKCFGR_I2S1SRC(n)     ((n) << RCC_DCKCFGR_I2S1SRC_SHIFT)
#define RCC_DCKCFGR_I2S2SRC_SHIFT    (28)     /* Bits 28-29: I2S APB2 clock source selection */
#define RCC_DCKCFGR_I2S2SRC_MASK     (0x3 << RCC_DCKCFGR_I2S2SRC_SHIFT)
#  define RCC_DCKCFGR_I2S2SRC(n)     ((n) << RCC_DCKCFGR_I2S2SRC_SHIFT)

#define RCC_SAI2CLKSRC_PLLSAI        0
#define RCC_SAI2CLKSRC_PLLI2S        1
#define RCC_SAI2CLKSRC_PLLR          2
#define RCC_SAI2CLKSRC_HSX           3

#define RCC_SAI1CLKSRC_PLLSAI        0
#define RCC_SAI1CLKSRC_PLLI2S        1
#define RCC_SAI1CLKSRC_PLLR          2
#define RCC_SAI2CLKSRC_I2S_CLKIN     3

#define RCC_I2SSRC_PLLI2S_R          0
#define RCC_I2SSRC_I2S_CKIN          1
#define RCC_I2SSRC_PLL_R             2
#define RCC_I2SSRC_HSX               3


/* RCC clocks gated enable register */

#define RCC_CKGATENR_AHB2APB1_CKEN   (1 << 0) /* Bit 0: AHB to APB1 Bridge clock enable */
#define RCC_CKGATENR_AHB2APB2_CKEN   (1 << 1) /* Bit 1: AHB to APB2 Bridge clock enable */
#define RCC_CKGATENR_CM4DBG_CKEN     (1 << 2) /* Bit 2: Cortex M4 ETM clock enable */
#define RCC_CKGATENR_SPARE_CKEN      (1 << 3) /* Bit 3: Spare clock enable */
#define RCC_CKGATENR_SRAM_CKEN       (1 << 4) /* Bit 4: SRQAM controller clock enable */
#define RCC_CKGATENR_FLITF_CKEN      (1 << 5) /* Bit 5: Flash Interface clock enable */
#define RCC_CKGATENR_RCC_CKEN        (1 << 6) /* Bit 6: RCC clock enable */

/* Dedicated clocks configuration register 2 */

#define RCC_DCKCFGR2_FMPI2C1SEL_SHIFT    (22)   /* Bits 22-23: I2C4 clock source selection */
#define RCC_DCKCFGR2_FMPI2C1SEL_MASK     (3 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT)
#  define RCC_DCKCFGR2_FMPI2C1SEL_APB    (0 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT)   /* APB1 clock (PCLK1) is selected as I2C 4 clock */
#  define RCC_DCKCFGR2_FMPI2C1SEL_SYSCLK (1 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT)   /* System clock is selected as I2C 4 clock */
#  define RCC_DCKCFGR2_FMPI2C1SEL_HSI    (2 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT)   /* HSI clock is selected as I2C 4 clock */
#define RCC_DCKCFGR2_CECSEL_SHIFT        (26)   /* Bit 26: HDMI-CEC clock source selection */
#define RCC_DCKCFGR2_CECSEL_MASK         (1 << RCC_DCKCFGR2_CECSEL_SHIFT)
#  define RCC_DCKCFGR2_CECSEL_LSE        (0 << RCC_DCKCFGR2_CECSEL_SHIFT)    /* LSE clock is selected as HDMI-CEC clock */
#  define RCC_DCKCFGR2_CECSEL_HSI        (1 << RCC_DCKCFGR2_CECSEL_SHIFT)    /* HSI clock is selected as HDMI-CEC clock */
#define RCC_DCKCFGR2_CK48MSEL_SHIFT      (27)   /* Bit 27: 48MHz clock source selection */
#define RCC_DCKCFGR2_CK48MSEL_MASK       (1 << RCC_DCKCFGR2_CK48MSEL_SHIFT)
#  define RCC_DCKCFGR2_CK48MSEL_PLL      (0 << RCC_DCKCFGR2_CK48MSEL_SHIFT)  /* 48MHz clock from PLL is selected */
#  define RCC_DCKCFGR2_CK48MSEL_PLLSAI   (1 << RCC_DCKCFGR2_CK48MSEL_SHIFT)  /* 48MHz clock from PLLSAI is selected */
#define RCC_DCKCFGR2_SDIOCSEL_SHIFT      (28)   /* Bit 28: SDIO clock source selection */
#define RCC_DCKCFGR2_SDIOCSEL_MASK       (1 << RCC_DCKCFGR2_SDIOCSEL_SHIFT)
#  define RCC_DCKCFGR2_SDIOCSEL_48MHZ    (0 << RCC_DCKCFGR2_SDIOCSEL_SHIFT)  /* 48 MHz clock is selected as SDMMC clock */
#  define RCC_DCKCFGR2_SDIOCSEL_SYSCLK   (1 << RCC_DCKCFGR2_SDIOCSEL_SHIFT)  /* System clock is selected as SDMMC clock */

#define RCC_DCKCFGR2_SPDIFRXEL_SHIFT     (29)   /* Bit 29: SPDIF-Rx clock selection */
#define RCC_DCKCFGR2_SPDIFRXEL_MASK      (1 << RCC_DCKCFGR2_SPDIFRXEL_SHIFT)
#  define RCC_DCKCFGR2_SPDIFRXEL_48MHZ   (0 << RCC_DCKCFGR2_SPDIFRXEL_SHIFT)  /* 48 MHz clock is selected as SDMMC clock */
#  define RCC_DCKCFGR2_SPDIFRXEL_SYSCLK  (1 << RCC_DCKCFGR2_SPDIFRXEL_SHIFT)  /* System clock is selected as SDMMC clock */

#endif /* CONFIG_STM32_STM32F446 */
#endif /* __ARCH_ARM_SRC_STM32_CHIP_STM32F44XXX_RCC_H */
